УчетВУправляющихДляГит1/src/Catalogs/НастройкиЯндексКассы/НастройкиЯндексКассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиЯндексКассы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СДоговором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторМагазина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВитрины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаЧековЧерезЯндекс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеНастройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусОбменовСЯндексКассой/СтатусОбменовСЯндексКассой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусОбменовСЯндексКассой</name>
  <resources>
    <name>ДатаПоследнегоУспешногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <comment>Реквизит необходим для обеспечения ограничения доступа</comment>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаЯндексКассы</name>
    <type>
      <types>CatalogRef.НастройкиЯндексКассы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Catalogs/НастройкиЯндексКассы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НастройкаУникальна() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ОбработатьДополнительныеНастройки();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	РегистрыСведений.СтатусОбменовСЯндексКассой.ОбновитьЗначениеРеквизитаОрганизация(Ссылка, Организация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкаУникальна()
	
	Если ПометкаУдаления Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиЯндексКассы.Наименование КАК НайденныйДоговорСЯндексКассой,
	|	""ИдентификаторМагазина"" КАК Реквизит
	|ИЗ
	|	Справочник.НастройкиЯндексКассы КАК НастройкиЯндексКассы
	|ГДЕ
	|	НастройкиЯндексКассы.Ссылка <> &Ссылка
	|	И НастройкиЯндексКассы.ИдентификаторМагазина = &ИдентификаторМагазина
	|	И НЕ НастройкиЯндексКассы.ПометкаУдаления
	|	И НЕ НастройкиЯндексКассы.Недействительна
	|	И НастройкиЯндексКассы.СДоговором = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиЯндексКассы.Наименование,
	|	""Организация""
	|ИЗ
	|	Справочник.НастройкиЯндексКассы КАК НастройкиЯндексКассы
	|ГДЕ
	|	НастройкиЯндексКассы.Ссылка <> &Ссылка
	|	И НастройкиЯндексКассы.Организация = &Организация
	|	И НЕ НастройкиЯндексКассы.ПометкаУдаления
	|	И НЕ НастройкиЯндексКассы.Недействительна";
	
	Запрос.УстановитьПараметр("ИдентификаторМагазина", ИдентификаторМагазина);
	Запрос.УстановитьПараметр("Организация",           Организация);
	Запрос.УстановитьПараметр("Ссылка",                Ссылка);
	Результат = Запрос.Выполнить();
	ТекущийДоговорУникален = Результат.Пустой();
	
	Если Не ТекущийДоговорУникален Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если Выборка.Реквизит = "Организация" Тогда 
			ШаблонСообщения = НСтр("ru = 'В информационной базе уже существует настройка для организации %1'");
		ИначеЕсли Выборка.Реквизит = "ИдентификаторМагазина" Тогда
			ШаблонСообщения = НСтр("ru = 'В информационной базе уже существует настройка с таким идентификатором магазина %2 (%3)'");
		КонецЕсли;	
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
			Организация, ИдентификаторМагазина, Выборка.НайденныйДоговорСЯндексКассой);
			
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Возврат ТекущийДоговорУникален;
	
КонецФункции

Процедура ОбработатьДополнительныеНастройки() 
	
	ДействующиеНастройки = ИнтеграцияСЯндексКассойСлужебный.ДополнительныеНастройкиЯндексКассы();
	// удаляем лишние
	НаУдаление = Новый Массив;
	Для каждого СтрокаНастроек Из ДополнительныеНастройки Цикл
		НайденнаяСтрока = ДействующиеНастройки.Найти(СтрокаНастроек.Настройка, "Настройка");
		Если НайденнаяСтрока = Неопределено Тогда
			НаУдаление.Добавить(СтрокаНастроек);
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаНастроек Из НаУдаление Цикл
		ДополнительныеНастройки.Удалить(СтрокаНастроек);
	КонецЦикла;
	// добавляем недостающие
	Для каждого СтрокаНастроек Из ДействующиеНастройки Цикл
		НайденнаяСтрока = ДополнительныеНастройки.Найти(СтрокаНастроек.Настройка, "Настройка");
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = ДополнительныеНастройки.Добавить();
			НоваяСтрока.Настройка = СтрокаНастроек.Настройка;
			НоваяСтрока.Значение = СтрокаНастроек.ТипЗначения.ПривестиЗначение();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
